IRP/src/Documents/Labeling/Labeling.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>Labeling</name>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <tabularSections>
  <name>ItemList</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>Item</name>
   <type>
    <types>CatalogRef.Items</types>
   </type>
  </attributes>
  <attributes>
   <name>ItemKey</name>
   <type>
    <types>CatalogRef.Items</types>
    <types>CatalogRef.ItemKeys</types>
    <types>CatalogRef.ItemTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>SerialLotNumber</name>
   <type>
    <types>CatalogRef.SerialLotNumbers</types>
   </type>
  </attributes>
  <attributes>
   <name>Barcode</name>
   <type>
    <types>DefinedType.typeBarcode</types>
   </type>
  </attributes>
  <attributes>
   <name>PurchaseOrder</name>
   <type>
    <types>DocumentRef.PurchaseOrder</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/Documents/Labeling/ObjectModule.bsl
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If DataExchange.Load Then
		Return;
	EndIf;
	
	For Each Row In ThisObject.ItemList Do
		If Not ValueIsFilled(Row.Key) Then
			Row.Key = String(New UUID());
		EndIf;
	EndDo;
EndProcedure

Procedure OnWrite(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure BeforeDelete(Cancel)
	If DataExchange.Load Then
		Return;
	EndIf;
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	If TypeOf(FillingData) = Type("Structure") Then
		If FillingData.Property("BasedOn") Then
			For Each FillingDataItem In FillingData.BasedOn Do
				Filling_BasedOnPurchaseOrder(FillingDataItem);
			EndDo;
		EndIf;
	EndIf;
EndProcedure

Procedure Filling_BasedOnPurchaseOrder(FillingData)
	For Each Row In FillingData.ItemList Do
		If Int(Row.Quantity) = Row.Quantity Then
			For CountQauntity = 1 To Row.Quantity Do
				NewRow = ThisObject.ItemList.Add();
				FillPropertyValues(NewRow, Row);
				NewRow.PurchaseOrder = FillingData.Ref;
			EndDo;
		Else
			NewRow = ThisObject.ItemList.Add();
			FillPropertyValues(NewRow, Row);
		EndIf;
	EndDo;
EndProcedure
